app/views/gossips/edit.html.erb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  <br/>
  <p>Title à modifier : <%= Gossip.find(params[:id]).title%></p>
  <p>Content à modifier : <%= Gossip.find(params[:id]).content%></p>