app/views/gossips/show.html.erb

<p>
  Potin n° <%= Gossip.find(params[:id]).id %><br/>
  Son auteur :<a href="/user/<%= Gossip.find(params[:id]).user.id%>"><%= Gossip.find(params[:id]).user.first_name %></a><br/>
  Sa ville : <%= User.find(params[:id]).city.city %></a><br/>
  Son titre :  <%= Gossip.find(params[:id]).title %><br/>
  Et le gossip : <%= Gossip.find(params[:id]).content %><br/>
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]