app/views/home/home.html.erb


  <% Gossip.all.each_with_index do |gossip,index| %>
---
SELECT "gossips".* FROM "gossips"

    <div class="card-body">
      <h5 class="card-title">Potin n° <%= Gossip.find(index + 1).id %><br/></h5>
      <p class="card-text">Son auteur :  <%= Gossip.find(index + 1).user.first_name %><br/></p>
      <p class="card-text">Son titre :  <%= Gossip.find(index + 1).title %><br/><br/></p>
      <a href="/gossips/<%= Gossip.find(index + 1).id %>" class="btn btn-primary">Viens voir ce Gossip de plus près !</a>
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]