app/views/city/show.html.erb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
<h1>Page City </h1>
<p>Bienvenue sur le profil de la ville de : <%= City.find(params[:id]).city %> !! <br> Check ses users :</p>

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" INNER JOIN "users" ON "gossips"."user_id" = "users"."id" WHERE "users"."city_id" = ?  [["city_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."city_id" = ? LIMIT ?  [["city_id", 3], ["LIMIT", 1]]
---

    <% City.find(params[:id]).gossips.each do |gossip| %>
        <%= gossip.user.first_name %><br/>