app/views/city/show.html.erb

<p>
<% Gossip.all.each_with_index do |gossip,index| %>
---
SELECT "gossips".* FROM "gossips"