app/views/user/show.html.erb

<p>
  Son ptit prénom : <%= User.find(params[:id]).first_name %><br/>
  Son petit nom :  <%= User.find(params[:id]).last_name %><br/>
  Son age :  <%= User.find(params[:id]).age %> ans<br/>
  Sa ville : <a href="/city/<%= User.find(params[:id]).city_id%>"><%= User.find(params[:id]).city.city %></a><br/>

  Et son petit mail : <%= User.find(params[:id]).email %><br/>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]