app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Bonjour"], ["content", "ca va bien ou bien "], ["user_id", 11], ["created_at", "2021-02-10 10:50:55.969399"], ["updated_at", "2021-02-10 10:50:55.969399"]]
---
  def create
    @gossip = Gossip.new(title: params["title"], content: params["content"], user_id: 11) # avec xxx qui sont les données obtenues à partir du formulaire

    if @gossip.save # essaie de sauvegarder en base @gossip

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["title", "Ca va marcher"], ["content", "Modifier Gossip"], ["updated_at", "2021-02-10 18:03:17.505845"], ["id", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(title: params["title"], content: params["content"])