app/controllers/user_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "password_digest", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        cit_maggle = City.where(city: params["city"])
        @user = User.new(first_name: params["first_name"], last_name: params["last_name"], description: params["description"], email: params["email"],  age: params["age"], password_digest: params["password_digest"], city: City.find(params["city"])) # avec xxx qui sont les données obtenues à partir du formulaire

        if @user.save # essaie de sauvegarder en base @gossip